RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_smif_sfdp.c
/***************************************************************************//**
* \file cy_smif_sfdp.c
* \version 2.30
*
* \brief
*  This file provides the source code for SFDP enumeration in SMIF driver.
*
* Note:
*
********************************************************************************
* \copyright
* Copyright 2021 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device.h"

#if defined (CY_IP_MXSMIF)

#include "cy_smif_memslot.h"

#if defined(__cplusplus)
extern "C" {
#endif

/** \cond INTERNAL */
/***************************************
*     Internal Constants
***************************************/

#define READ_ENHANCED_MODE_DISABLED (0xFFU)
#define BITS_IN_BYTE                (8U)
#define BYTES_IN_DWORD              (4U)
#define FOUR_BYTE_ADDRESS           (4U)     /* 4 byte addressing mode */
#define BITS_IN_BYTE_ABOVE_4GB      (3U)     /* Density of memory above 4GBit stored as poser of 2 */
#define PARAM_HEADERS_NUM           (CY_SMIF_SFDP_BFPT_BYTE_06)
#define FIRST_HEADER_OFFSET         (0x08U)  /* The offset of the 1-st Parameter Header */
#define PARAM_ID_MSB_REL_OFFSET     (0x07U)  /* The relative offset of Parameter ID MSB
                                             * in the SFDP Header table
                                             */
#define PARAM_MINOR_REV_REL_OFFSET  (0x01U)  /* The relative offset of Parameter Minor Revision
                                             * in the SFDP Header table
                                             */
#define PARAM_MAJOR_REV_REL_OFFSET  (0x02U)  /* The relative offset of Parameter Major Revision
                                             * in the SFDP Header table
                                             */
#define PARAM_TABLE_PRT_OFFSET      (0x04UL) /* The relative offset of Parameter Table Pointer Byte 1 */
#define PARAM_TABLE_LENGTH_OFFSET   (0X03U)  /* The offset of Parameter Table Length in the Header Table */
#define PARAM_HEADER_NUM            (6U)     /* The supported number of the parameter headers */
#define HEADER_LENGTH               (0x8U)   /* The length of the SFDP header */
#define HEADERS_LENGTH              (HEADER_LENGTH + \
                                                 (CY_SMIF_SFDP_PARAM_HEADER_LENGTH * PARAM_HEADER_NUM))
#define TYPE_STEP                   (2UL)    /* The Erase Type step in the Basic Flash Parameter Table */
#define INSTRUCTION_NOT_SUPPORTED   (0XFFU)  /* The code for the not supported instruction */
#define BASIC_SPI_ID                (0XFF00UL) /* The JEDEC SFDP Basic SPI Flash Parameter ID */
#define SECTOR_MAP_ID               (0xFF81UL) /* The JEDEC SFDP Sector Map ID */
#define SECTOR_MAP_DESCRIPTOR_MASK   (0x2U)  /* The mask for the type bit of the Sector Map descriptor */
#define SECTOR_MAP_COMAND_DESCRIPTOR_TYPE (0U) /* Code for the command descriptor type */
#define SECTOR_MAP_REGION_SIZE_MULTIPLIER (256UL) /* The multiplier for region size units */
#define FOUR_BYTE_ADDR_ID           (0XFF84UL) /* The 4-byte Address Instruction Table is assigned the ID MSB of FFh */
#define FOUR_BYTE_ADDR_ERASE_TYPE_1 (0X4UL)  /* The Erase Type 1 offset in 4-byte Address Instruction Table */
#define FOUR_BYTE_ADDR_ERASE_TYPE_4 (0X7UL)  /* The Erase Type 4 offset in 4-byte Address Instruction Table */
#define ERASE_T_COUNT_Pos           (0UL)    /* Erase Type X Erase, Typical time: count (Bits 4:0) */
#define ERASE_T_COUNT_Msk           (0x1FUL) /* Erase Type X Erase, Typical time: count (Bitfield-Mask) */
#define ERASE_T_UNITS_Pos           (5UL)    /* Erase Type X Erase, Typical time: units (Bits 6:5) */
#define ERASE_T_UNITS_Msk           (0x60UL) /* Erase Type X Erase, Typical time: units (Bitfield-Mask) */
#define ERASE_T_COUNT_OFFSET        (0x04U)  /* The offset of the Erase count 10th DWORD */
#define ERASE_T_LENGTH              (0x07U)  /* The Erase Type Typical time length */
#define SCCR_MAP_SPI_ID             (0xFF87U)  /* SCCR Map for SPI Memory Devices MSB */
#define XSPI_PROFILE_1_0_ID         (0xFF05UL) /* eXtended Serial Peripheral Interface (xSPI) Profile 1.0 */
#define CMD_SEQ_FOR_ODDR_ID         (0xFF0AUL) /* Command Sequences to change to Octal DDR (8D-8D-8D) mode */
#define COMMAND_IS_NOT_FOUND        (0x0U)
#define PARAMETER_IS_NOT_FOUND      (0x0U)

#define SMIF_TRANSFER_TIMEOUT       (1000UL)      /* The timeout (microseconds) to use in polling of
                                                   * the transfer status of the SMIF block
                                                   */
#define SUPPORT_ERASE_COMMAND_Pos   (1UL)          /* The position of the Support for Erase Commands
                                                   * in byte 1 of the JEDEC 4-byte Address Instruction Table
                                                   */
#define SUPPORT_ERASE_COMMAND_Msk   (0x0000001EUL) /* The mask of the Support for Erase Commands
                                                   * in the JEDEC 4-byte Address Instruction Table
                                                   */
#define SUPPORT_FAST_READ_1S_1S_1S_CMD_Pos (1UL)          /* The position of the Support for Fast Read Command 1S-1S-1S
                                                          * in the JEDEC 4-byte Address Instruction Table, DWORD 1
                                                          */
#define SUPPORT_FAST_READ_1S_1S_1S_CMD_Msk (0x00000002UL) /* The mask of the Support for Fast Read Command 1S-1S-1S
                                                          * in the JEDEC 4-byte Address Instruction Table, DWORD 1
                                                          */
#define SUPPORT_FAST_READ_1S_1S_2S_CMD_Pos (2UL)          /* The position of the Support for Fast Read Command 1S-1S-2S
                                                          * in the JEDEC 4-byte Address Instruction Table, DWORD 1
                                                          */
#define SUPPORT_FAST_READ_1S_1S_2S_CMD_Msk (0x00000004UL) /* The mask of the Support for Fast Read Command 1S-1S-2S
                                                          * in the JEDEC 4-byte Address Instruction Table, DWORD 1
                                                          */
#define SUPPORT_FAST_READ_1S_2S_2S_CMD_Pos (3UL)          /* The position of the Support for Fast Read Command 1S-2S-2S
                                                          * in the JEDEC 4-byte Address Instruction Table, DWORD 1
                                                          */
#define SUPPORT_FAST_READ_1S_2S_2S_CMD_Msk (0x00000008UL) /* The mask of the Support for Fast Read Command 1S-2S-2S
                                                          * in the JEDEC 4-byte Address Instruction Table, DWORD 1
                                                          */
#define SUPPORT_FAST_READ_1S_1S_4S_CMD_Pos (4UL)          /* The position of the Support for Fast Read Command 1S-1S-4S
                                                          * in the JEDEC 4-byte Address Instruction Table, DWORD 1
                                                          */
#define SUPPORT_FAST_READ_1S_1S_4S_CMD_Msk (0x00000010UL) /* The mask of the Support for Fast Read Command 1S-1S-4S
                                                          * in the JEDEC 4-byte Address Instruction Table, DWORD 1
                                                          */
#define SUPPORT_FAST_READ_1S_4S_4S_CMD_Pos (5UL)          /* The position of the Support for Fast Read Command 1S-4S-4S
                                                          * in the JEDEC 4-byte Address Instruction Table, DWORD 1
                                                          */
#define SUPPORT_FAST_READ_1S_4S_4S_CMD_Msk (0x00000020UL) /* The mask of the Support for Fast Read Command 1S-4S-4S
                                                          * in the JEDEC 4-byte Address Instruction Table, DWORD 1
                                                          */
#define SUPPORT_PP_1S_1S_1S_CMD_Pos (6UL)              /* The position of the Support for Page Program Command 1S-1S-1S
                                                        * in the JEDEC 4-byte Address Instruction Table, DWORD 1
                                                        */
#define SUPPORT_PP_1S_1S_1S_CMD_Msk (0x00000040UL)     /* The mask of the Support for Page Program Command 1S-1S-1S
                                                        * in the JEDEC 4-byte Address Instruction Table, DWORD 1
                                                        */
#define SUPPORT_PP_1S_1S_4S_CMD_Pos (7UL)              /* The position of the Support for Page Program Command 1S-1S-4S
                                                        * in the JEDEC 4-byte Address Instruction Table, DWORD 1
                                                        */
#define SUPPORT_PP_1S_1S_4S_CMD_Msk (0x00000080UL)     /* The mask of the Support for Page Program Command 1S-1S-4S
                                                        * in the JEDEC 4-byte Address Instruction Table, DWORD 1
                                                        */
#define SUPPORT_PP_1S_4S_4S_CMD_Pos (8UL)              /* The position of the Support for Page Program Command 1S-4S-4S
                                                        * in the JEDEC 4-byte Address Instruction Table, DWORD 1
                                                        */
#define SUPPORT_PP_1S_4S_4S_CMD_Msk (0x00000100UL)     /* The mask of the Support for Page Program Command 1S-4S-4S
                                                        * in the JEDEC 4-byte Address Instruction Table, DWORD 1
                                                        */
#define SUPPORT_FAST_READ_1S_1S_8S_CMD_Pos (20UL)         /* The position of the Support for Fast Read Command 1S-1S-8S */
#define SUPPORT_FAST_READ_1S_1S_8S_CMD_Msk (0x00100000UL) /* The mask of the Support for Fast Read Command 1S-1S-8S */
#define SUPPORT_FAST_READ_1S_8S_8S_CMD_Pos (21UL)         /* The position of the Support for Fast Read Command 1S-8S-8S */
#define SUPPORT_FAST_READ_1S_8S_8S_CMD_Msk (0x00200000UL) /* The mask of the Support for Fast Read Command 1S-8S-8S */
#define SUPPORT_FAST_READ_1S_8D_8D_CMD_Pos (22UL)         /* The position of the Support for Fast Read Command 1S-8D-8D */
#define SUPPORT_FAST_READ_1S_8D_8D_CMD_Msk (0x00400000UL) /* The mask of the Support for Fast Read Command 1S-8D-8D */
#define SUPPORT_PP_1S_1S_8S_CMD_Pos        (23UL)         /* The position of the Support for Page Program Command 1S-1S-8S */
#define SUPPORT_PP_1S_1S_8S_CMD_Msk        (0x00400000UL) /* The mask of the Support for Page Program Command 1S-1S-8S */
#define SUPPORT_PP_1S_8S_8S_CMD_Pos        (24UL)         /* The position of the Support for Page Program Command 1S-8S-8S */
#define SUPPORT_PP_1S_8S_8S_CMD_Msk        (0x00400000UL) /* The mask of the Support for Page Program Command 1S-8S-8S */

#define FOUR_BYTE_ADDRESS_TABLE_BYTE_0 (0U)  /* Byte 0x00 of the JEDEC 4-byte Address Instruction Table */
#define FOUR_BYTE_ADDRESS_TABLE_BYTE_1 (1U)  /* Byte 0x01 of the JEDEC 4-byte Address Instruction Table */
#define ERASE_TYPE_COUNT               (4U)  /* The number of Erase Types  */

