RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_smif_sfdp.c
/*******************************************************************************
* Function Name: SfdpGetProgramFourBytesCmd
****************************************************************************//**
*
* Sets the Page Program command instruction for 4-byte addressing mode.
*
* \note When the Program command is not found for 4 byte addressing mode
* the Program command instruction is set for 1S-1S-1S Protocol mode and
* 3-byte addressing mode.
*
* \param sfdpBuffer
* The pointer to an array with the SDFP buffer with the 4-byte Address
* Instruction table.
*
* \param protocolMode
* Protocol Mode.
*
* \param cmdProgram
* The pointer to the Program command parameters structure.
*
*******************************************************************************/
static void SfdpGetProgramFourBytesCmd(uint8_t const sfdpBuffer[],
                                       cy_en_smif_protocol_mode_t protocolMode,
                                       cy_stc_smif_mem_cmd_t* cmdProgram)
{
    /* Get the mask which contains the Support for Page Program Commands
     * from 4-byte Address Instruction Table, DWORD 1
     */
    uint32_t sfdpForBytesTableDword1 = ((uint32_t*)sfdpBuffer)[FOUR_BYTE_ADDRESS_TABLE_BYTE_0];

    switch (protocolMode)
    {
        case PROTOCOL_MODE_1S_4S_4S:
#if (CY_IP_MXSMIF_VERSION>=2)
        case PROTOCOL_MODE_1S_4D_4D:
#endif /* CY_IP_MXSMIF_VERSION */
            if (_FLD2BOOL(SUPPORT_PP_1S_4S_4S_CMD, sfdpForBytesTableDword1))
            {
                SfdpSetProgramCommandFourBytes_1_4_4(cmdProgram);
            }
            else if (_FLD2BOOL(SUPPORT_PP_1S_1S_4S_CMD, sfdpForBytesTableDword1))
            {
                SfdpSetProgramCommandFourBytes_1_1_4(cmdProgram);
            }
            else if (_FLD2BOOL(SUPPORT_PP_1S_1S_1S_CMD, sfdpForBytesTableDword1))
            {
                SfdpSetProgramCommandFourBytes_1_1_1(cmdProgram);
            }
            else
            {
                /* There are no instructions for 4-byte mode. Use the instruction for 3-byte mode */
                SfdpSetProgramCommand_1_1_1(cmdProgram);
            }
            break;
        case PROTOCOL_MODE_1S_1S_4S:
            if (_FLD2BOOL(SUPPORT_PP_1S_1S_4S_CMD, sfdpForBytesTableDword1))
            {
                SfdpSetProgramCommandFourBytes_1_1_4(cmdProgram);
            }
            else if (_FLD2BOOL(SUPPORT_PP_1S_1S_1S_CMD, sfdpForBytesTableDword1))
            {
                SfdpSetProgramCommandFourBytes_1_1_1(cmdProgram);
            }
            else
            {
                /* There are no instructions for 4-byte mode. Use the instruction for 3-byte mode */
                SfdpSetProgramCommand_1_1_1(cmdProgram);
            }
            break;
        case PROTOCOL_MODE_1S_2S_2S:
        case PROTOCOL_MODE_1S_1S_2S:
        case PROTOCOL_MODE_1S_1S_1S:
            if (_FLD2BOOL(SUPPORT_PP_1S_1S_1S_CMD, sfdpForBytesTableDword1))
            {
                SfdpSetProgramCommandFourBytes_1_1_1(cmdProgram);
            }
            else
            {
                /* There are no instructions for 4-byte mode. Use the instruction for 3-byte mode */
                SfdpSetProgramCommand_1_1_1(cmdProgram);
            }
            break;
        default:
            /* Wrong mode */
            CY_ASSERT_L2(true);
            break;
    }
}


/*******************************************************************************
* Function Name: SfdpSetWipStatusRegisterCommand
****************************************************************************//**
*
* Sets the WIP-containing status register command and
* the width of the command transfer.
*
* \param readStsRegWipCmd
* The pointer to the WIP-containing status register command parameters structure.
*
*******************************************************************************/
static void SfdpSetWipStatusRegisterCommand(cy_stc_smif_mem_cmd_t* readStsRegWipCmd)
{
    /* 8-bit command. WIP RDSR */
    readStsRegWipCmd->command  = CY_SMIF_READ_STATUS_REG1_CMD;
    /* The command transfer width */
    readStsRegWipCmd->cmdWidth = CY_SMIF_WIDTH_SINGLE;
}


/*******************************************************************************
* Function Name: SfdpSetChipEraseCommand
****************************************************************************//**
*
* Sets the Chip Erase command and the width of the command transfer.
*
* \param cmdChipErase
* The pointer to the Chip Erase command parameters structure.
*
*******************************************************************************/
static void SfdpSetChipEraseCommand(cy_stc_smif_mem_cmd_t* cmdChipErase)
{
    /* 8-bit command. Chip Erase */
    cmdChipErase->command  = CY_SMIF_CHIP_ERASE_CMD;
    /* The width of the command transfer */
    cmdChipErase->cmdWidth = CY_SMIF_WIDTH_SINGLE;
}


/*******************************************************************************
* Function Name: SfdpGetSectorEraseCommand
****************************************************************************//**
*
* Sets the Sector Erase command and the width of the command transfer.
*
* \note When the Erase command is not found the width of the command
*  transfer (cmdWidth) is set to CY_SMIF_WIDTH_NA.
*
* \param device
* The device structure instance declared by the user. This is where the detected
* parameters are stored and returned.
*
* \param sfdpBuffer
* The pointer to an array with the SDFP buffer.
*
* \param eraseTypeStc
* The pointer to an array with the erase commands for different erase types.
*
* \return The offset of the Sector Erase command in the SFDP buffer.
*  Returns 0 when the Sector Erase command is not found.
*
*******************************************************************************/
static uint32_t SfdpGetSectorEraseCommand(cy_stc_smif_mem_device_cfg_t *device,
                                          uint8_t const sfdpBuffer[],
                                          cy_stc_smif_erase_type_t eraseTypeStc[])
{
    uint32_t eraseOffset;
    if (FOUR_BYTE_ADDRESS == device->numOfAddrBytes)
    {
        uint32_t eraseType;     /* Erase Type decreased to 1 */
        uint32_t eraseTypeMask;

        eraseOffset = COMMAND_IS_NOT_FOUND;
        device->eraseCmd->command = CY_SMIF_NO_COMMAND_OR_MODE;

