RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_smif_sfdp.c
        /* Get the mask which contains the Support for Erase Commands (Types 1-4)
         * from 4-byte Address Instruction Table, DWORD 1
         */
        eraseTypeMask = _FLD2VAL(SUPPORT_ERASE_COMMAND, (uint32_t)sfdpBuffer[FOUR_BYTE_ADDRESS_TABLE_BYTE_1]);

        /* Find Erase Type (decreased to 1) */
        for (eraseType = 0UL; eraseType <= ERASE_TYPE_COUNT; eraseType++)
        {
            if ((1UL << eraseType) == (eraseTypeMask & (1UL << eraseType)))
            {
                /* Erase Type found */
                break;
            }
        }

        if (eraseType < ERASE_TYPE_COUNT)
        {
            /* Calculate the offset for the sector Erase command in the 4-byte Address Instruction Table, DWORD 2 */
            eraseOffset = FOUR_BYTE_ADDR_ERASE_TYPE_1 + eraseType;

            /* Update all erase commands for 4-bytes */
            for(uint32_t i = 0UL; i< ERASE_TYPE_COUNT; i++)
            {
                eraseTypeStc[i].eraseCmd = sfdpBuffer[FOUR_BYTE_ADDR_ERASE_TYPE_1 + i];
            }
            /* Get the sector Erase command
             * from the 4-byte Address Instruction Table, DWORD 2
             */
            device->eraseCmd->command = sfdpBuffer[eraseOffset];
#if (CY_IP_MXSMIF_VERSION>=2)
            device->eraseCmd->cmdPresence = CY_SMIF_PRESENT_1BYTE;
#endif /* CY_IP_MXSMIF_VERSION */

            /* Recalculate eraseOffset for the 3-byte Address Instruction Table
             * to find the device->eraseSize and device->eraseTime parameters based on Erase Type.
             */
            eraseOffset = CY_SMIF_SFDP_BFPT_BYTE_1D + (eraseType * TYPE_STEP);
        }
    }
    else
    {
        eraseOffset = CY_SMIF_SFDP_BFPT_BYTE_1D;
        while (INSTRUCTION_NOT_SUPPORTED == sfdpBuffer[eraseOffset])
        {
            if (eraseOffset >= CY_SMIF_SFDP_BFPT_BYTE_23)
            {
                /* The Sector Erase command is not found */
                eraseOffset = COMMAND_IS_NOT_FOUND;
                break;
            }
            eraseOffset += TYPE_STEP; /* Check the next Erase Type */
        }

        if (COMMAND_IS_NOT_FOUND != eraseOffset)
        {
            /* Get the sector Erase command from the JEDEC basic flash parameter table */
            device->eraseCmd->command = sfdpBuffer[eraseOffset];
#if (CY_IP_MXSMIF_VERSION>=2)
            device->eraseCmd->cmdPresence = CY_SMIF_PRESENT_1BYTE;
#endif /* CY_IP_MXSMIF_VERSION */
        }
    }

    if (COMMAND_IS_NOT_FOUND != eraseOffset)
    {
        /* The command transfer width */
        device->eraseCmd->cmdWidth = CY_SMIF_WIDTH_SINGLE;

        /* The address transfer width */
        device->eraseCmd->addrWidth = CY_SMIF_WIDTH_SINGLE;
    }
    else
    {
        device->eraseCmd->cmdWidth = CY_SMIF_WIDTH_NA;
    }

    return(eraseOffset);
}

/*******************************************************************************
* Function Name: SfdpEnterFourByteAddressing
****************************************************************************//**
*
* This function sets 4-byte address mode for a memory device as defined in
* 16th DWORD of JEDEC Basic Flash Parameter Table.
*
* \note The entry methods which do not support the required
* operation of writing into the register.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param entryMethodByte
* The byte which defines the supported method to enter 4-byte addressing mode.
*
* \param device
* The device structure instance declared by the user. This is where the detected
* parameters are stored and returned.
*
* \param slaveSelect
* The slave select line for the device.
*
* \param context
* This is the pointer to the context structure \ref cy_stc_smif_context_t
* allocated by the user. The structure is used during the SMIF
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return A status of 4-byte addressing mode command transmit.
*       - \ref CY_SMIF_SUCCESS
*       - \ref CY_SMIF_EXCEED_TIMEOUT
*       - \ref CY_SMIF_CMD_NOT_FOUND
*******************************************************************************/
static cy_en_smif_status_t SfdpEnterFourByteAddressing(SMIF_Type *base, uint8_t entryMethodByte,
                                                       cy_stc_smif_mem_device_cfg_t *device,
                                                       cy_en_smif_slave_select_t slaveSelect,
                                                       cy_stc_smif_context_t const *context)
{
    cy_en_smif_status_t result = CY_SMIF_CMD_NOT_FOUND;
    if ((entryMethodByte & CY_SMIF_SFDP_ENTER_4_BYTE_METHOD_ALWAYS_4_BYTE) != 0U)
    {
        /* Memory always operates in 4-byte mode */
        result = CY_SMIF_SUCCESS;
    }
    if ((entryMethodByte & CY_SMIF_SFDP_ENTER_4_BYTE_METHOD_B7) != 0U)
    {
        if ((entryMethodByte & CY_SMIF_SFDP_ENTER_4_BYTE_METHOD_WR_EN_B7) != 0U)
        {
            /* To enter a 4-byte addressing write enable is required */
            cy_stc_smif_mem_cmd_t* writeEn = device->writeEnCmd;
            if(NULL != writeEn)
            {
                result = Cy_SMIF_TransmitCommand(base,
                                                (uint8_t) writeEn->command,
                                                writeEn->cmdWidth,
                                                NULL,
                                                CY_SMIF_CMD_WITHOUT_PARAM,
                                                CY_SMIF_WIDTH_NA,
                                                slaveSelect,
                                                CY_SMIF_TX_LAST_BYTE,
                                                context);
            }
        }
        if ((CY_SMIF_CMD_NOT_FOUND == result) || (CY_SMIF_SUCCESS == result))
        {
            /* To enter a 4-byte addressing B7 instruction is required */
            result = Cy_SMIF_TransmitCommand(base,
                                             CY_SMIF_SFDP_ENTER_4_BYTE_METHOD_B7_CMD,
                                             CY_SMIF_WIDTH_SINGLE,
                                             NULL,
                                             CY_SMIF_CMD_WITHOUT_PARAM,
                                             CY_SMIF_WIDTH_NA,
                                             slaveSelect,
                                             CY_SMIF_TX_LAST_BYTE,
                                             context);
        }
    }

    return result;
}


