RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_smif_sfdp.c
    if (CY_SMIF_SUCCESS == result)
    {
        /* Find the matching configuration map descriptor */
        while(regionInfoIdx != sectorMapBuff[currTableIdx + 1UL])
        {
            /* Increment the table index to the next map */
            currTableIdx += (sectorMapBuff[currTableIdx + CY_SMIF_SFDP_SECTOR_MAP_CONFIG_ID_OFFSET] + 2UL) * BYTES_IN_DWORD;
            if (currTableIdx > buffLength)
            {
                result = CY_SMIF_SFDP_CORRUPTED_TABLE;
                break;
            }
        }
    }

    if (CY_SMIF_SUCCESS == result)
    {
        /* Populate region data from the sector map */
        uint8_t numOfRegions = sectorMapBuff[currTableIdx + CY_SMIF_SFDP_SECTOR_MAP_REGION_COUNT_OFFSET] + 1U;
        device->hybridRegionCount = (uint32_t) numOfRegions;

        if(numOfRegions <= 1U)
        {
            result = CY_SMIF_NOT_HYBRID_MEM;
        }
        else
        {
            uint8_t eraseTypeCode;
            uint32_t currRegionAddr = 0UL;
            uint32_t regionSize = 0UL;
            uint8_t supportedEraseType;
            uint8_t eraseTypeMask;
            cy_stc_smif_hybrid_region_info_t *currRegionPtr;
            for(uint8_t currRegion = 0U; currRegion< numOfRegions; currRegion++)
            {
                currRegionAddr = currRegionAddr + regionSize;
                currTableIdx += BYTES_IN_DWORD;

                supportedEraseType = 0U;
                eraseTypeMask = 1U;
                eraseTypeCode = sectorMapBuff[currTableIdx] & CY_SMIF_SFDP_SECTOR_MAP_SUPPORTED_ET_MASK;
                while(0U == (eraseTypeCode & eraseTypeMask))
                {
                    /* Erase type number defined as a bit position */
                    eraseTypeMask = eraseTypeMask << 1;
                    supportedEraseType++;
                    if(supportedEraseType > ERASE_TYPE_COUNT)
                    {
                        result = CY_SMIF_SFDP_CORRUPTED_TABLE;
                        break;
                    }
                }

                /* The region size as a zero-based count of 256 byte units */
                regionSize = ((*( (uint32_t*) &sectorMapBuff[currTableIdx]) >> BITS_IN_BYTE) + 1UL) * SECTOR_MAP_REGION_SIZE_MULTIPLIER;
                CY_MISRA_BLOCK_END('MISRA C-2012 Rule 11.3');
                currRegionPtr = device->hybridRegionInfo[currRegion];

                currRegionPtr->regionAddress = currRegionAddr;
                currRegionPtr->eraseCmd = (uint32_t)eraseType[supportedEraseType].eraseCmd;
                currRegionPtr->eraseTime = eraseType[supportedEraseType].eraseTime;
                if(regionSize < eraseType[supportedEraseType].eraseSize)
                {
                    /* One region with a single sector */
                    currRegionPtr->eraseSize = regionSize;
                    currRegionPtr->sectorsCount = 1UL;
                }
                else
                {
                    currRegionPtr->eraseSize = eraseType[supportedEraseType].eraseSize;
                    currRegionPtr->sectorsCount = regionSize / eraseType[supportedEraseType].eraseSize;
                }
            }
        }
    }
    return result;
}

#if (CY_IP_MXSMIF_VERSION>=2)
static cy_en_smif_protocol_mode_t GetOctalSDRParams(SMIF_Type *base,
                                    uint8_t sfdpBuffer[],
                                    cy_stc_smif_mem_device_cfg_t *device,
                                    cy_en_smif_slave_select_t slaveSelect,
                                    uint32_t sfdpForBytesTableDword1,
                                    uint8_t *sccrMapAddr,
                                    uint8_t  sccrMapTableLength,
                                    cy_stc_smif_context_t *context)
{
    cy_en_smif_protocol_mode_t protocol = PROTOCOL_MODE_WRONG;
    cy_en_smif_status_t result = CY_SMIF_NO_OE_BIT;
    cy_stc_smif_mem_cmd_t *cmdSfdp = device->readSfdpCmd;
    cy_stc_smif_mem_cmd_t *cmdRead = device->readCmd;

    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3', 'Pointer type conversion is intentional.');

    if (_FLD2BOOL(SUPPORT_FAST_READ_1S_8S_8S_CMD,
              sfdpForBytesTableDword1))
    {
         SfdpGetReadCmd_1_8_8(sfdpBuffer, cmdRead);
         protocol = PROTOCOL_MODE_1S_8S_8S;
    }
    else if (_FLD2BOOL(SUPPORT_FAST_READ_1S_8S_8S_CMD,
                        sfdpForBytesTableDword1))
    {
        SfdpGetReadCmd_1_1_8(sfdpBuffer, cmdRead);
        protocol = PROTOCOL_MODE_1S_1S_8S;
    }
    else
    {
        /* Do Nothing */
    }

    if (protocol != PROTOCOL_MODE_WRONG)
    {
        /* Get Octal Enable commands and mask */
        uint8_t sccrMapAddrBuffer[CY_SMIF_SFDP_LENGTH];

        /* Get the JEDEC SCCR Map Table content into sfdpBuffer[] */
        result = SfdpReadBuffer(base, cmdSfdp, sccrMapAddr, slaveSelect,
                            sccrMapTableLength, sccrMapAddrBuffer, context);

        if (result == CY_SMIF_SUCCESS)
        {
            /* Get the mask which contains the Support for Fast Read Commands
             * from SCCR Map Table, DWORD 16
             */
            CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3', 'Pointer type conversion is intentional.');
            uint32_t sccrMapAddrBufferDword16 = (*(uint32_t*)&sccrMapAddrBuffer[CY_SMIF_SFDP_SCCR_MAP_BYTE_3B]);

            /* Read DWORD-16 to fill read and write Octal Enable commands */
            if (_FLD2BOOL(CY_SMIF_SFDP_OCTAL_ENABLE_BIT_SUPPORT, sccrMapAddrBufferDword16))
            {
                    device->stsRegOctalEnableMask = _FLD2VAL(CY_SMIF_SFDP_OCTAL_ENABLE_BIT, sccrMapAddrBufferDword16);
                    device->writeStsRegOeCmd->command  = _FLD2VAL(CY_SMIF_SFDP_OCTAL_ENABLE_WRITE_CMD, sccrMapAddrBufferDword16);
                    device->readStsRegOeCmd->command  = _FLD2VAL(CY_SMIF_SFDP_OCTAL_ENABLE_READ_CMD, sccrMapAddrBufferDword16);

                    if (_FLD2BOOL(CY_SMIF_SFDP_OCTAL_ENABLE_USE_ADDRESS, sccrMapAddrBufferDword16))
                    {
                       device->octalEnableRegAddr = _FLD2VAL(CY_SMIF_SFDP_OCTAL_ENABLE_REG_ADDR, sccrMapAddrBufferDword16);
                    }
                    else
                    {
                       device->octalEnableRegAddr = CY_SMIF_NO_COMMAND_OR_MODE;
                    }
                    device->writeStsRegOeCmd->cmdPresence  = CY_SMIF_PRESENT_1BYTE;
                    device->readStsRegOeCmd->cmdPresence  = CY_SMIF_PRESENT_1BYTE;
            }
        }
    }

    return protocol;
}
static cy_en_smif_protocol_mode_t GetOctalDDRParams(SMIF_Type *base,
                                    cy_stc_smif_mem_device_cfg_t *device,
                                    cy_en_smif_slave_select_t slaveSelect,
                                    uint8_t* cmdSeqODDRAddr,
                                    uint8_t cmdSeqODDRTableLength,
                                    uint8_t* xSPiProfile1Addr,
                                    uint8_t xSPIProfile1TableLength,
                                    uint8_t* sccrMapAddr,
                                    uint8_t sccrMapTableLength,
                                    cy_stc_smif_context_t *context)
{
    uint8_t xSPiProfile1AddrBuffer[CY_SMIF_SFDP_LENGTH];
    cy_en_smif_status_t result = CY_SMIF_NO_OE_BIT;
    cy_stc_smif_mem_cmd_t *cmdSfdp = device->readSfdpCmd;
    cy_stc_smif_mem_cmd_t *cmdRead = device->readCmd;
    cy_en_smif_protocol_mode_t pMode = PROTOCOL_MODE_WRONG;
    CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.8', 5, 'uint8_t to uin32_t type conversion intentional.');
    CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.6', 4, 'composite expression to uint32_t conversion intentional.');

    /* Initialize SFDP Buffer */
    for (uint32_t i = 0U; i < CY_SMIF_SFDP_LENGTH; i++)
    {
        xSPiProfile1AddrBuffer[i] = 0U;
    }

