RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_smif_sfdp.c
    /* Get the JEDEC xSPI Profile 1.0 content into xSPiProfile1AddrBuffer[] */
    result = SfdpReadBuffer(base, cmdSfdp, xSPiProfile1Addr, slaveSelect,
                            xSPIProfile1TableLength, xSPiProfile1AddrBuffer, context);

    if (CY_SMIF_SUCCESS == result)
    {
        /* If found Octal DDR read is supported */
        if (xSPiProfile1AddrBuffer[XSPI_PROFILE_1_TABLE_BYTE_1] != 0U)
        {
             cmdRead->command = xSPiProfile1AddrBuffer[XSPI_PROFILE_1_TABLE_BYTE_1];
             cmdRead->commandH = cmdRead->command;

             /* command presence - 2 byte transfer */
             cmdRead->cmdPresence = CY_SMIF_PRESENT_2BYTE;

             /* The command transfer width */
             cmdRead->cmdWidth = CY_SMIF_WIDTH_OCTAL;

             /* DDR rate for all phases */
             cmdRead->cmdRate = CY_SMIF_DDR;
             cmdRead->dataRate = CY_SMIF_DDR;
             cmdRead->modeRate = CY_SMIF_DDR;
             cmdRead->addrRate = CY_SMIF_DDR;

             /* The address transfer width */
             cmdRead->addrWidth = CY_SMIF_WIDTH_OCTAL;

             /* The 8-bit mode byte. This value is 0xFFFFFFFF when there is no mode present */
              cmdRead->mode = CY_SMIF_NO_COMMAND_OR_MODE;

             /* Variable latency configuration command */
             if (sccrMapTableLength > 0U)
             {
                SfdpSetVariableLatencyCmd(base, device, slaveSelect, sccrMapAddr, context);
             }

             if ((device->writeLatencyCmd->command != CY_SMIF_NO_COMMAND_OR_MODE))
             {
                uint8_t cfr_reg_address[5U];
                uint8_t cfr_value = 0;

                /* Initialize DWords */
                for (uint8_t i = 0U; i < 5U; i++)
                {
                    cfr_reg_address[i] = 0U;
                }

                switch (device->freq_of_operation)
                {
                    case CY_SMIF_100MHZ_OPERATION:
                        /* DWORD-5, Bits 11:7 should be > 0 to confirm if 100 MHz is supported or not */
                        if ( ((xSPiProfile1AddrBuffer[16] & 0x80U) | ((xSPiProfile1AddrBuffer[17] & 0x0FU) << 1U)) > 0U)
                        {
                            cmdRead->dummyCycles = (uint32_t) ((xSPiProfile1AddrBuffer[16] & 0x80U) | ((xSPiProfile1AddrBuffer[17] & 0x0FU) << 1U));

                            /* DWORD-5 Bits 6:2 */
                            cfr_value = (xSPiProfile1AddrBuffer[16] & 0x7CU);
                        }

                        break;
                    case CY_SMIF_133MHZ_OPERATION:
                        /* DWORD-5, Bits 21:17 should be > 0 to confirm if 133 MHz is supported or not */
                        if ((xSPiProfile1AddrBuffer[17] & 0x3EU) > 0U)
                        {
                             cmdRead->dummyCycles = (uint32_t) (xSPiProfile1AddrBuffer[17] & 0x3EU);

                            /* DWORD-5, Bits 21:17 */
                            cfr_value = ((xSPiProfile1AddrBuffer[17] & 0xF0U) << 1U) | (xSPiProfile1AddrBuffer[18] & 0x1U);
                        }
                        break;
                    case CY_SMIF_166MHZ_OPERATION:
                        /* DWORD-5, Bits 31:27 should be > 0 to confirm if 133 MHz is supported or not */
                        if ((xSPiProfile1AddrBuffer[19] & 0xE0U) > 0U)
                        {
                               cmdRead->dummyCycles = (uint32_t) xSPiProfile1AddrBuffer[19] & 0xE0U;

                            /* DWORD -5 Bits 26:22 */
                            cfr_value = ((xSPiProfile1AddrBuffer[19] & 0x07U) << 2U) | (xSPiProfile1AddrBuffer[18] & 0xC0U);
                        }
                        break;
                    case CY_SMIF_200MHZ_OPERATION:
                        /* DWORD-4, Bits 11:7 should be > 0 to confirm if 133 MHz is supported or not */
                        if ( ((xSPiProfile1AddrBuffer[12] & 0x80U) | ((xSPiProfile1AddrBuffer[13] & 0x0FU) << 1U)) > 0U)
                        {
                            cmdRead->dummyCycles = (uint32_t) ((xSPiProfile1AddrBuffer[12] & 0x80U) | ((xSPiProfile1AddrBuffer[13] & 0x0FU) << 1U));

                            /* DWORD-4 Bits 6:2 */
                            cfr_value = (xSPiProfile1AddrBuffer[12] & 0x7CU);
                        }
                        break;
                    default:
                        /* Do Nothing */
                        break;
                }

                if (cfr_value > 0U)
                {
                    ValueToByteArray(device->latencyCyclesRegAddr, cfr_reg_address, 0, 4U);
                    cfr_reg_address[4] = cfr_value;

                    result = Cy_SMIF_MemCmdWriteRegister(base,
                                         slaveSelect,
                                         device->writeEnCmd,
                                         device->writeLatencyCmd,
                                         cfr_reg_address,
                                         5U,
                                         context);
                }

             }
             else
             {
                 cmdRead->dummyCycles = 8U; /* Default value */
             }

             /* dummy cycles present - 2 byte transfer */
             if(cmdRead->dummyCycles > 0UL)
             {
                 cmdRead->dummyCyclesPresence = CY_SMIF_PRESENT_2BYTE;
             }

             /* The data transfer width */
             cmdRead->dataWidth = CY_SMIF_WIDTH_OCTAL;

             pMode = PROTOCOL_MODE_8D_8D_8D;

             /* Fill command sequence to switch to Octal DDR mode */
             uint8_t cmdSeqODDRAddrBuffer[CY_SMIF_SFDP_LENGTH];

            /* Initialize SFDP Buffer */
            for (uint32_t i = 0U; i < CY_SMIF_SFDP_LENGTH; i++)
            {
                cmdSeqODDRAddrBuffer[i] = 0U;
            }

            if (result == CY_SMIF_SUCCESS)
            {
                 /* Get the command sequence to change to Octal DDR mode content into cmdSeqODDRAddrBuffer[] */
                 result = SfdpReadBuffer(base, cmdSfdp, cmdSeqODDRAddr, slaveSelect,
                                cmdSeqODDRTableLength, cmdSeqODDRAddrBuffer, context);
            }

            if (result == CY_SMIF_SUCCESS)
            {
                cy_stc_smif_octal_ddr_en_seq_t* oDDREnSeq = device->octalDDREnableSeq;

                oDDREnSeq->cmdSeq1Len = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD1_LEN_BYTE_OFFSET];
                oDDREnSeq->cmdSeq2Len = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD2_LEN_BYTE_OFFSET];
                if (oDDREnSeq->cmdSeq1Len > 0U && oDDREnSeq->cmdSeq1Len < CY_SMIF_SFDP_ODDR_CMD_SEQ_MAX_LEN)
                {
                    oDDREnSeq->cmdSeq1[0] = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD1_LEN_BYTE_OFFSET - 1U];
                    oDDREnSeq->cmdSeq1[1] = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD1_LEN_BYTE_OFFSET - 2U];
                    oDDREnSeq->cmdSeq1[2] = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD1_LEN_BYTE_OFFSET - 3U];
                    oDDREnSeq->cmdSeq1[3] = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD1_LEN_BYTE_OFFSET + 4U];
                    oDDREnSeq->cmdSeq1[4] = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD1_LEN_BYTE_OFFSET + 3U];
                    oDDREnSeq->cmdSeq1[5] = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD1_LEN_BYTE_OFFSET + 2U];
                    oDDREnSeq->cmdSeq1[6] = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD1_LEN_BYTE_OFFSET + 1U];
                }
                if (oDDREnSeq->cmdSeq2Len > 0U && oDDREnSeq->cmdSeq2Len < CY_SMIF_SFDP_ODDR_CMD_SEQ_MAX_LEN)
                {
                    oDDREnSeq->cmdSeq2[0] = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD2_LEN_BYTE_OFFSET - 1U];
                    oDDREnSeq->cmdSeq2[1] = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD2_LEN_BYTE_OFFSET - 2U];
                    oDDREnSeq->cmdSeq2[2] = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD2_LEN_BYTE_OFFSET - 3U];
                    oDDREnSeq->cmdSeq2[3] = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD2_LEN_BYTE_OFFSET + 4U];
                    oDDREnSeq->cmdSeq2[4] = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD2_LEN_BYTE_OFFSET + 3U];
                    oDDREnSeq->cmdSeq2[5] = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD2_LEN_BYTE_OFFSET + 2U];
                    oDDREnSeq->cmdSeq2[6] = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD2_LEN_BYTE_OFFSET + 1U];
                }
            }
        }
    }
    CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.6');
    CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.8');
    return pMode;
}
#endif

