RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_smif_sfdp.c
/*******************************************************************************
* Function Name: Cy_SMIF_MemInitSfdpMode
****************************************************************************//**
*
* This function can be used for any preferred data width based command instruction set from SFDP Buffer.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memCfg
* The memory configuration structure that configures the SMIF memory device to
*  map into the device memory map. \ref cy_stc_smif_mem_config_t
*
* \param maxdataWidth
* maximum data width available on physical interface.
*
* \param qer_id
* Quad enable requirement ID specifically used for SFDP 1.0 compliant devices where
* Quad mode is available for use, but SFDP basic flash parameter table does not specify
* quad mode enable instruction. In other cases, this can be passed as CY_SMIF_SFDP_QER_0.
*
* \param context
* This is the pointer to the context structure \ref cy_stc_smif_context_t
* allocated by the user. The structure is used during the SMIF
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return A status of the transmission.
*       - \ref CY_SMIF_SUCCESS
*       - \ref CY_SMIF_CMD_NOT_FOUND
*       - \ref CY_SMIF_SFDP_CORRUPTED_TABLE
*       - \ref CY_SMIF_EXCEED_TIMEOUT
*
*******************************************************************************/

cy_en_smif_status_t Cy_SMIF_MemInitSfdpMode(SMIF_Type *base,
                                    const cy_stc_smif_mem_config_t *memCfg,
                                    cy_en_smif_txfr_width_t maxdataWidth,
                                    cy_en_smif_qer_t qer_id,
                                    cy_stc_smif_context_t *context)
{
    /* Check the input parameters */
    CY_ASSERT_L1(NULL != memCfg);
    CY_ASSERT_L1(NULL != memCfg->deviceCfg);

    uint8_t sfdpBuffer[CY_SMIF_SFDP_LENGTH];
    uint8_t sfdpAddress[CY_SMIF_SFDP_ADDRESS_LENGTH];
    uint8_t addr4ByteAddress[CY_SMIF_SFDP_ADDRESS_LENGTH];
    uint8_t sectorMapAddr[CY_SMIF_SFDP_ADDRESS_LENGTH];
    uint8_t sccrMapAddr[CY_SMIF_SFDP_ADDRESS_LENGTH];
    uint8_t xSPiProfile1Addr[CY_SMIF_SFDP_ADDRESS_LENGTH];
    uint8_t cmdSeqODDRAddr[CY_SMIF_SFDP_ADDRESS_LENGTH];
    cy_en_smif_status_t result = CY_SMIF_NO_SFDP_SUPPORT;
    cy_stc_smif_erase_type_t eraseType[ERASE_TYPE_COUNT];
    uint8_t basicSpiTableLength = 0U, addr4ByteTableLength = 0U, sccrMapTableLength = 0U;
    uint8_t cmdSeqODDRTableLength = 0U, sectorMapTableLength = 0U, xSPIProfile1TableLength = 0U;
    cy_stc_smif_mem_device_cfg_t *device = memCfg->deviceCfg;
    cy_en_smif_slave_select_t slaveSelect = memCfg->slaveSelect;
    cy_en_smif_data_select_t dataSelect = memCfg->dataSelect;
    cy_stc_smif_mem_cmd_t *cmdSfdp = device->readSfdpCmd;

    /* Initialize the SFDP buffer */
    for (uint32_t i = 0U; i < CY_SMIF_SFDP_LENGTH; i++)
    {
        sfdpBuffer[i] = 0U;
    }

    /* Initialize the SFDP Table addresses */
    for (uint8_t i = 0U; i < CY_SMIF_SFDP_ADDRESS_LENGTH; i++)
    {
        sfdpAddress[i] = 0U;
        addr4ByteAddress[i] = 0U;
        sectorMapAddr[i] = 0U;
        sccrMapAddr[i] = 0U;
        xSPiProfile1Addr[i] = 0U;
        cmdSeqODDRAddr[i] = 0U;
    }
    /* Slave slot initialization */
    Cy_SMIF_SetDataSelect(base, slaveSelect, dataSelect);

    if (NULL != cmdSfdp)
    {
        /* Get the SDFP header and all parameter headers content into sfdpBuffer[] */
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 18.6','Data receive is disabled after function return.');
        result = SfdpReadBuffer(base, cmdSfdp, sfdpAddress, slaveSelect, HEADERS_LENGTH, sfdpBuffer, context);
    }
    else
    {
        result = CY_SMIF_NO_SFDP_SUPPORT;
    }

    if((CY_SMIF_SUCCESS == result) &&
       (sfdpBuffer[CY_SMIF_SFDP_SIGNATURE_BYTE_00] == (uint8_t)'S') &&
       (sfdpBuffer[CY_SMIF_SFDP_SIGNATURE_BYTE_01] == (uint8_t)'F') &&
       (sfdpBuffer[CY_SMIF_SFDP_SIGNATURE_BYTE_02] == (uint8_t)'D') &&
       (sfdpBuffer[CY_SMIF_SFDP_SIGNATURE_BYTE_03] == (uint8_t)'P') &&
       (sfdpBuffer[CY_SMIF_SFDP_MAJOR_REV] == CY_SMIF_SFDP_MAJOR_REV_1))
    {
        uint8_t sfdp_minor_revision = sfdpBuffer[CY_SMIF_SFDP_MINOR_REV];

        /* Find the JEDEC SFDP Basic SPI Flash Parameter Header */
        SfdpFindParameterTableAddress(BASIC_SPI_ID, sfdpBuffer, sfdpAddress, &basicSpiTableLength);

        if (basicSpiTableLength > 0U)
        {
            SfdpFindParameterTableAddress(FOUR_BYTE_ADDR_ID, sfdpBuffer, addr4ByteAddress, &addr4ByteTableLength);
            SfdpFindParameterTableAddress(SCCR_MAP_SPI_ID, sfdpBuffer, sccrMapAddr, &sccrMapTableLength);
            SfdpFindParameterTableAddress(XSPI_PROFILE_1_0_ID, sfdpBuffer, xSPiProfile1Addr, &xSPIProfile1TableLength);
            SfdpFindParameterTableAddress(CMD_SEQ_FOR_ODDR_ID, sfdpBuffer, cmdSeqODDRAddr, &cmdSeqODDRTableLength);
            SfdpFindParameterTableAddress(SECTOR_MAP_ID, sfdpBuffer, sectorMapAddr, &sectorMapTableLength);

            if (sectorMapTableLength == 0U)
            {
                device->hybridRegionCount = 0UL;
                device->hybridRegionInfo = NULL;
                result = CY_SMIF_SUCCESS; /* Not a Hybrid Memory */
            }

            /* Check if any of the parameter table size is more than SFDP Buffer length reserved */
            if ((basicSpiTableLength     > CY_SMIF_SFDP_LENGTH) ||
                (sectorMapTableLength    > CY_SMIF_SFDP_LENGTH))
            {
                result = CY_SMIF_SFDP_BUFFER_INSUFFICIENT;
            }
            if (CY_SMIF_SUCCESS == result)
            {
                CY_ASSERT_L1(CY_SMIF_CHECK_DEVICE_MEMBERS(device));

                /* Get the JEDEC basic flash parameter table content into sfdpBuffer[] */
                result = SfdpReadBuffer(base, cmdSfdp, sfdpAddress, slaveSelect, basicSpiTableLength, sfdpBuffer, context);

                /* The erase size and erase time for all 4 erase types */
                SfdpGetEraseSizeAndCmd(sfdpBuffer, eraseType);

