RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_smif_sfdp.c
                /* The external memory size */
                device->memSize = SfdpGetMemoryDensity(sfdpBuffer);

                /* The number of address bytes used by the memory slave device */
                device->numOfAddrBytes = SfdpGetNumOfAddrBytes(sfdpBuffer, device->memSize);

                /* The Write Enable command */
                SfdpSetWriteEnableCommand(device->writeEnCmd);

                /* The Write Disable command */
                SfdpSetWriteDisableCommand(device->writeDisCmd);

                /* The busy mask for the status registers */
                device->stsRegBusyMask = CY_SMIF_STATUS_REG_BUSY_MASK;

                /* The command to read the WIP-containing status register */
                SfdpSetWipStatusRegisterCommand(device->readStsRegWipCmd);

                if (maxdataWidth >= CY_SMIF_WIDTH_QUAD)
                {
                    if(sfdp_minor_revision != CY_SMIF_SFDP_JEDEC_REV_0)
                    {
                        /* The command to write into the QE-containing status register */
                        CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.8', 1, 'integer to enum conversion intentional.');
                        SfdpGetQuadEnableParameters(device,
                                                    (cy_en_smif_qer_t)(_FLD2VAL(CY_SMIF_SFDP_QE_REQUIREMENTS,
                                                    (uint32_t)sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_3A])));
                        CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.8');
                    }
                    else
                    {
                        SfdpGetQuadEnableParameters(device, qer_id);
                    }
                }

                /* Chip Erase command */
                SfdpSetChipEraseCommand(device->chipEraseCmd);

                /* The Read command for 3-byte addressing. The preference order quad > dual > single SPI */
                cy_stc_smif_mem_cmd_t *cmdRead = device->readCmd;
                cy_en_smif_protocol_mode_t pMode = PROTOCOL_MODE_WRONG;

                if(sfdp_minor_revision != CY_SMIF_SFDP_JEDEC_REV_0)
                {
                    /* The page size */
                    device->programSize = SfdpGetPageSize(sfdpBuffer);

                    /* Chip Erase Time */
                    device->chipEraseTime = SfdpGetChipEraseTime(sfdpBuffer);

                    /* Page Program Time */
                    device->programTime = SfdpGetPageProgramTime(sfdpBuffer);

                }
                else
                {
                    /* The page size - Default value */
                    device->programSize = CY_SMIF_SFDP_PAGE_SIZE_DEFAULT;

                    /* Chip Erase Time - Maximum value by default */
                    device->chipEraseTime = CY_SMIF_SFDP_CHIP_ERASE_TIME_64S;

                    /* Page Program Time - Maximum value by default */
                    device->programTime = CY_SMIF_SFDP_PROG_TIME_DEFAULT;

                    /* Enumerate Single SPI mode for SFDP 1.0 devices with QER 0 */
                    if (qer_id == CY_SMIF_SFDP_QER_0)
                    {
                        maxdataWidth = CY_SMIF_WIDTH_SINGLE;
                    }
                }

                pMode = SfdpGetReadCmdParams(sfdpBuffer, dataSelect, maxdataWidth, cmdRead);

                /* Read, Erase, and Program commands */
                uint32_t eraseTypeOffset = 1UL;
                if (FOUR_BYTE_ADDRESS == device->numOfAddrBytes)
                {
                    /* Enter 4-byte addressing mode */
                    result = SfdpEnterFourByteAddressing(base, sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_3C], device, slaveSelect, context);
                    uint8_t fourByteAddressBuffer[CY_SMIF_SFDP_LENGTH];

                    /* Initialize SFDP Buffer */
                    for (uint32_t i = 0U; i < CY_SMIF_SFDP_LENGTH; i++)
                    {
                        fourByteAddressBuffer[i] = 0U;
                    }

                    if (CY_SMIF_SUCCESS == result)
                    {
                        /* Get the JEDEC 4-byte Address Instruction Table content into sfdpBuffer[] */
                        result = SfdpReadBuffer(base, cmdSfdp, addr4ByteAddress, slaveSelect,
                                                addr4ByteTableLength, fourByteAddressBuffer, context);
                    }
#if (CY_IP_MXSMIF_VERSION>=2)
                    /* Check if Octal mode related is supported first */
                    if ((device->readStsRegOeCmd != NULL) && (device->writeStsRegOeCmd != NULL))
                    {
                        if ((CY_SMIF_SUCCESS == result) && (maxdataWidth == CY_SMIF_WIDTH_OCTAL))
                        {
                            cy_en_smif_protocol_mode_t octalProtocolMode = PROTOCOL_MODE_WRONG;

                            if ((cmdSeqODDRTableLength > 0U) && (xSPIProfile1TableLength > 0U) && (device->octalDDREnableSeq != NULL))
                            {
                                octalProtocolMode = GetOctalDDRParams(base, device, slaveSelect,
                                                                      cmdSeqODDRAddr, cmdSeqODDRTableLength,
                                                                      xSPiProfile1Addr, xSPIProfile1TableLength,
                                                                      sccrMapAddr, sccrMapTableLength,
                                                                      context);
                            }

                            if(octalProtocolMode != PROTOCOL_MODE_8D_8D_8D) /* Check for Octal SDR if Octal DDR was not supported */
                            {
                                octalProtocolMode = GetOctalSDRParams(base, sfdpBuffer, device, slaveSelect, fourByteAddressBuffer[FOUR_BYTE_ADDRESS_TABLE_BYTE_0],
                                                             sccrMapAddr, sccrMapTableLength, context);
                            }

                            if (octalProtocolMode != PROTOCOL_MODE_WRONG)
                            {
                                pMode = octalProtocolMode;
                            }
                        }
                        else
                        {
                           device->writeStsRegOeCmd->command  = CY_SMIF_NO_COMMAND_OR_MODE;
                           device->readStsRegOeCmd->command  = CY_SMIF_NO_COMMAND_OR_MODE;
                           device->octalEnableRegAddr = CY_SMIF_NO_COMMAND_OR_MODE;
                           device->stsRegOctalEnableMask = 0UL;
                           device->writeStsRegOeCmd->cmdPresence  = CY_SMIF_NOT_PRESENT;
                           device->readStsRegOeCmd->cmdPresence  = CY_SMIF_NOT_PRESENT;
                        }
                    }
#endif
                    if (CY_SMIF_SUCCESS == result)
                    {
                        /* Rewrite the Read command instruction for 4-byte addressing mode */
                        SfdpGetReadFourBytesCmd(fourByteAddressBuffer, pMode, cmdRead);

                        /* Get the Program command instruction for 4-byte addressing mode */
                        SfdpGetProgramFourBytesCmd(fourByteAddressBuffer, pMode, device->programCmd);

